let questions = [
    {
    numb: 1,
    question: "भारतीय संविधान का कौन सा अनुच्छेद राज्य नीति के निदेशक सिद्धांतों को निर्दिष्ट करता है?",
    answer: "B) अनुच्छेद 36",
    options: [
      "A) अनुच्छेद 44",
      "B) अनुच्छेद 36",
      "C) अनुच्छेद 51",
      "D) अनुच्छेद 39"
    ]
  },
    {
    numb: 2,
    question: " आर्य समाज की स्थापना किसने की थी?",
    answer: "B) स्वामी दयानंद सरस्वती",
    options: [
      "A) स्वामी विवेकानंद",
      "B) स्वामी दयानंद सरस्वती",
      "C) रामकृष्ण परमहंस",
      "D) बाल गंगाधर तिलक"
    ]
  },
    {
    numb: 3,
    question: "किस भारतीय राज्य में मानस राष्ट्रीय उद्यान स्थित है?",
    answer: "A) असम",
    options: [
      "A) असम",
      "B) पश्चिम बंगाल",
      "C) मध्य प्रदेश",
      "D) कर्नाटक"
    ]
  },
    {
    numb: 4,
    question: "'विधायिका' किस संविधानिक अंग का हिस्सा है?",
    answer: "C) विधायिका",
    options: [
      "A) कार्यपालिका",
      "B) न्यायपालिका",
      "C) विधायिका",
      "D) निर्वाचन आयोग"
    ]
  },
    {
    numb: 5,
    question: "परमाणु ऊर्जा आयोग की स्थापना किस वर्ष हुई थी?",
    answer: "A) 1948",
    options: [
      "A) 1948",
      "B) 1952",
      "C) 1962",
      "D) 1970"
    ]
  },
    {
    numb: 6,
    question: "गोडावरी नदी का उद्गम स्थान कहाँ है?",
    answer: "A) त्र्यंबकेश्वर",
    options: [
      "A) त्र्यंबकेश्वर",
      "B) अमरकंटक",
      "C) महाबलेश्वर",
      "D) पंचगनी"
    ]
  },
    {
    numb: 7,
    question: " कौन सा भारतीय पर्वत श्रेणी पश्चिमी घाट का हिस्सा है?",
    answer: "B) सह्याद्रि",
    options: [
      "A) विन्ध्याचल",
      "B) सह्याद्रि",
      "C) अरावली",
      "D) सतपुड़ा"
    ]
  },
    {
    numb: 8,
    question: "भारतीय योजना आयोग का गठन कब हुआ था?",
    answer: "A) 1950",
    options: [
      "A) 1950",
      "B) 1951",
      "C) 1948",
      "D) 1949"
    ]
  },
    {
    numb: 9,
    question: "'शुद्धिपथ' किस आंदोलन से संबंधित है?",
    answer: "B) सामाजिक सुधार आंदोलन",
    options: [
      "A) भारतीय स्वतंत्रता संग्राम",
      "B) सामाजिक सुधार आंदोलन",
      "C) दलित सुधार आंदोलन",
      "D) स्वदेशी आंदोलन"
    ]
  },
    {
    numb: 10,
    question: "कौन सा राज्य भारत में 'ड्राई स्टेट' के रूप में जाना जाता है?",
    answer: "B) गुजरात",
    options: [
      "A) महाराष्ट्र",
      "B) गुजरात",
      "C) तमिलनाडु",
      "D) पंजाब"
    ]
  },
    {
    numb: 11,
    question: "किस घटना के बाद महात्मा गांधी ने असहयोग आंदोलन वापस लिया था?",
    answer: "B) चौरी चौरा कांड",
    options: [
      "A) जलियांवाला बाग हत्याकांड",
      "B) चौरी चौरा कांड",
      "C) काकोरी कांड",
      "D) सविनय अवज्ञा आंदोलन"
    ]
  },
    {
    numb: 12,
    question: "वैश्विक नवाचार सूचकांक 2021 में भारत किस स्थान पर था?",
    answer: "D) 46",
    options: [
      "A) 48",
      "B) 52",
      "C) 36",
      "D) 46"
    ]
  },
    {
    numb: 13,
    question: "भारतीय रिजर्व बैंक की स्थापना किस वर्ष हुई थी?",
    answer: "A) 1935",
    options: [
      "A) 1935",
      "B) 1947",
      "C) 1950",
      "D) 1925"
    ]
  },
   {
    numb: 14,
    question: "लोकसभा के अध्यक्ष की नियुक्ति कौन करता है?",
    answer: "C) लोकसभा सदस्य",
    options: [
      "A) प्रधानमंत्री",
      "B) राष्ट्रपति",
      "C) लोकसभा सदस्य",
      "D) उपराष्ट्रपति"
    ]
  },
   {
    numb: 15,
    question: "निम्नलिखित में से कौन सा सबसे बड़ा ग्रह है?",
    answer: "C) बृहस्पति",
    options: [
      "A) पृथ्वी",
      "B) मंगल",
      "C) बृहस्पति",
      "D) शुक्र"
    ]
  },
   {
    numb: 16,
    question: "भारतीय संविधान की किस धारा में मौलिक अधिकार दिए गए हैं?",
    answer: "A) भाग III",
    options: [
      "A) भाग III",
      "B) भाग IV",
      "C) भाग V",
      "D) भाग II"
    ]
  },
   {
    numb: 17,
    question: "'स्वराज' शब्द का प्रयोग सर्वप्रथम किसने किया था?",
    answer: "B) बाल गंगाधर तिलक",
    options: [
      "A) महात्मा गांधी",
      "B) बाल गंगाधर तिलक",
      "C) जवाहरलाल नेहरू",
      "D) सुभाष चंद्र बोस"
    ]
  },
   {
    numb: 18,
    question: "पंचवर्षीय योजनाओं की योजना और निरीक्षण कौन करता है?",
    answer: "D) योजना आयोग",
    options: [
      "A) वित्त आयोग",
      "B) नीति आयोग",
      "C) लोकसभा",
      "D) योजना आयोग"
    ]
  },
   {
    numb: 19,
    question: "'अधिवास' शब्द का अर्थ क्या होता है?",
    answer: "A) आवास का अधिकार",
    options: [
      "A) आवास का अधिकार",
      "B) मतदान का अधिकार",
      "C) सामाजिक समानता",
      "D) मौलिक अधिकार"
    ]
  },
   {
    numb: 20,
    question: "भारत में GST लागू करने का उद्देश्य क्या था?",
    answer: "B) सभी प्रकार के अप्रत्यक्ष करों को एकजुट करना",
    options: [
      "A) केवल आयकर सुधार",
      "B) सभी प्रकार के अप्रत्यक्ष करों को एकजुट करना",
      "C) सीमा शुल्क को हटाना",
      "D) व्यक्तिगत कर दर को बढ़ाना"
    ]
  },
   {
    numb: 21,
    question: "संविधान की आठवीं अनुसूची में कितनी भाषाओं का उल्लेख है?",
    answer: "C) 22",
    options: [
      "A) 14",
      "B) 18",
      "C) 22",
      "D) 25"
    ]
  },
   {
    numb: 22,
    question: "भूदान आंदोलन के संस्थापक कौन थे?",
    answer: "A) विनोबा भावे",
    options: [
      "A) विनोबा भावे",
      "B) महात्मा गांधी",
      "C) जयप्रकाश  नारायण",
      "D) जवाहरलाल नेहरू"
    ]
  },
   {
    numb: 23,
    question: "'ब्लू रिवोल्यूशन' का संबंध किससे है?",
    answer: "A) मत्स्य पालन",
    options: [
      "A) मत्स्य पालन",
      "B) पशुपालन",
      "C) कृषि",
      "D) स्वच्छता"
    ]
  },
   {
    numb: 24,
    question: "भारत में सबसे पहले किस राज्य ने महिलाओं को वोट देने का अधिकार दिया?",
    answer: "D) मद्रास प्रेसीडेंसी",
    options: [
      "A) महाराष्ट्र",
      "B) तमिलनाडु",
      "C) केरल",
      "D) मद्रास प्रेसीडेंसी"
    ]
  },
   {
    numb: 25,
    question: "किस भारतीय प्रधानमंत्री ने 'गरीबी हटाओ' का नारा दिया था?",
    answer: "B) इंदिरा गांधी",
    options: [
      "A) लाल बहादुर शास्त्री",
      "B) इंदिरा गांधी",
      "C) राजीव गांधी",
      "D) मनमोहन सिंह"
    ]
  },
   {
    numb: 26,
    question: "हरित क्रांति का उद्देश्य क्या था?",
    answer: "B) खाद्य उत्पादन बढ़ाना",
    options: [
      "A) उद्योग का विकास",
      "B) खाद्य उत्पादन बढ़ाना",
      "C) आर्थिक सुधार",
      "D) वैज्ञानिक शोध"
    ]
  },
   {
    numb: 27,
    question: "'सविनय अवज्ञा आंदोलन' कब शुरू किया गया था?",
    answer: "B) 1930",
    options: [
      "A) 1920",
      "B) 1930",
      "C) 1942",
      "D) 1919"
    ]
  },
   {
    numb: 28,
    question: "'प्रशासनिक सुधार आयोग' का गठन किसके द्वारा किया गया था?",
    answer: "A) इंदिरा गांधी",
    options: [
      "A) इंदिरा गांधी",
      "B) जवाहरलाल नेहरू",
      "C) राजीव गांधी",
      "D) लाल बहादुर शास्त्री"
    ]
  },
   {
    numb: 29,
    question: "सैमन कमीशन के भारत आने का विरोध क्यों किया गया था?",
    answer: "B) इसमें कोई भारतीय सदस्य नहीं था",
    options: [
      "A) यह केवल आर्थिक सुधारों से संबंधित था",
      "B) इसमें कोई भारतीय सदस्य नहीं था",
      "C) यह अंग्रेजों द्वारा संचालित था",
      "D) यह केवल सामाजिक सुधारों पर ध्यान केंद्रित कर रहा था"
    ]
  },
   {
    numb: 30,
    question: "भारत में पंचायती राज व्यवस्था की सिफारिश किस समिति ने की थी?",
    answer: "A) बलवंत राय मेहता समिति",
    options: [
      "A) बलवंत राय मेहता समिति",
      "B) अशोक मेहता समिति",
      "C) वाई वी चव्हाण समिति",
      "D) कस्तूरीरंगन समिति"
    ]
  },
];